Revit 2027 API
BuildingEnvelopeAnalyzer.GetBoundingElements Method
 Returns the collection of building elements exposed to the outside forming the building envelope.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<LinkElementId> GetBoundingElements()
Public Function GetBoundingElements As IList(Of LinkElementId)
public:
IList<LinkElementId^>^ GetBoundingElements()
member GetBoundingElements : unit -> IList<LinkElementId>
Return Value
IList<LinkElementId>
 The ids of the building elements in the envelope.
See Also
Reference
BuildingEnvelopeAnalyzer Class
Autodesk.Revit.DB.Analysis Namespace